{
  "notes": [
    {
      "versionCode": 2,
      "versionName": "1.x.x",
      "isMajor": true,
      "title": "",
      "notes": [
        "View a season overview",
        "See the results for all F1 races from 2019 dating back to 2000",
        "See the qualifying results for Q1, Q2 and Q3 for all races",
        "As of May 2020 it is unclear what the 2020 season will look like, so I cannot guarantee that new races will be updated live",
        "Changed app flow to default to the season overview screens rather than the 2019 season",
        "Changed theme throughout so it can be more customisable down the road"
      ]
    },
    {
      "versionCode": 4,
      "versionName": "2.x.x",
      "isMajor": true,
      "title": "",
      "notes": [
        "All F1 races! Look back to the start of the championship in 1950",
        "Overhauled UI for viewing the history of F1",
        "Added championship standings options to all seasons",
        "See a breakdown of the constructor standings per race",
        "Fixed some blank spaces in 2017 race data"
      ]
    },
    {
      "versionCode": 27,
      "versionName": "4.x.x",
      "isMajor": false,
      "title": "",
      "notes": [
        "Material Design 2 inspired UI! ",
        "Dark mode!",
        "RSS feed! Pick and choose your favourite Formula 1 RSS feeds, or add your own!",
        "Driver Overview! See a history of any drivers performance in F1!",
        "Added track layout images to some of the modern tracks",
        "Adds setting option to open news articles in external browser by default",
        "Adds wikipedia links to driver overview, race and circuit information screens",
        "Adds support for one off track layouts for certain races",
        "Added grid penalty indicator to race qualifying view",
        "Moved app banner position to pinned position at the top of the display",
        "Adds ability to customise bar animations throughout the app",
        "Adds constructor colour bars around the app where constructor is shown",
        "Added setting to expand season list to full height by default",
        "Handles constructors championship starting in 1958 properly",
        "Changed loading stack to only show spinner and not skeleton views on initial load",
        "Fixed race status oversight in prep for 2020 season start",
        "Fixed pit lane starts not being filtered properly in qualifying view",
        "Fixes issue with driver stats qualifying data taking into account DNS",
        "Fixes crash in certain seasons in the 1980s",
        "Fixed some wording oversights with races being scheduled in the future or past",
        "Fixed issue with partial qualifying data not displaying when race data is unavailable",
        "Fixed DNF label showing up for not finished status",
        "Fix for closing driver season dropdown collapsing again",
        "Fixed DNF label showing when driver finishes normally",
        "Fixed message label appearing in top of screen properly",
        "Fixed position delta always being 0 for podium sitters",
        "Fixed some race data format errors from races in 1962",
        "Fixes theming issue with circuit icons that are not fully supported",
        "Fixes some constructor penalties not being applied to disqualified teams throughout F1"
      ]
    },
    {
      "versionCode": 57,
      "versionName": "5.x.x",
      "isMajor": false,
      "title": "",
      "notes": [
        "Constructor overview! View a simplistic history of a constructor in F1",
        "Widgets! Add an up next widget to your home screen",
        "Adds FP1, FP2, FP3, Qualifying and Race times for races that are up next",
        "Notification support! Get notified when a race or qualifying session 30 minutes before it starts",
        "Increases minimum support to Android 6.0 Marshemllow (API 23)",
        "Adds more track layouts, including upcoming Saudi Arabia and Miami",
        "Adds ability to set a default season to load the app into",
        "Moves season switcher from navigation bar to toolbar in preparation for search",
        "Added more subtle animations throughout",
        "Modernises layout of schedule view on the home screen!",
        "Made it clearer when data is currently unavailable in the app",
        "Adds copy of privacy policy in app",
        "Updates layout for driver overview constructor tab to make progression clearer",
        "Reduced time taken to load RSS feed",
        "Fixed edge case crash in 1990s qualifying data",
        "Minor optimisations for tablet layout sizing",
        "Fixed theming gaps in Android 6.0 and 6.1",
        "Fixes typos in notification channels",
        "Fixes more than 5 drivers under constructor not stacking properly",
        "Fixes crash when Show on map is pressed on certain devices",
        "Fixes some theming issues for new RSS feed section of the app",
        "Fixes some rare crashes in RSS configure screen",
        "Fixes error handling to automaticallu notify the Flashback Team of inconsistent data",
        "Fixes driver overview where drivers swap teams mid season",
        "Fixes for progress bar values sometimes being fractionally incorrect after animation",
        "Fixes some rare crashes with certain older seasons dates being misaligned",
        "Fixed bugs in up next highlighting",
        "Fixed bug in theme preference not being applied immediately",
        "More minor bug fixes and accessibility improvements"
      ]
    },
    {
      "versionCode": 110,
      "versionName": "6.x.x",
      "isMajor": false,
      "title": "",
      "notes": [
        "Search! Search for any driver, constructor, circuit or race from the entire history of F1",
        "Sprint qualifying! Now supports grand prix sprint qualifying data",
        "Calendar view! See all F1 seasons in the calendar view",
        "Android 12! Including the new splash screen, collapsible style headers and material you colour themes",
        "Purple becomes blue! Flashbacks primary colour is now blue",
        "Moves up next section to be integrated into the rest of the app!",
        "Adds notification support for free practice",
        "Adds more track layouts for older F1 circuits",
        "Adds sound and priority to notifications",
        "Adds pull to refresh support for RSS feed",
        "Accessibility bug fixes throughout all screens",
        "Updates notification banners to be more descriptive",
        "Minor theming updates in Up next section",
        "Minor bug fixes to new notification support",
        "More minor fixes in preparation for last half of 2021 season",
        "Minor updates to settings ordering and wording",
        "Improved error handling when data is missing",
        "Improves experience of enrolling in notifications",
        "Simplifies wording for default season management",
        "Content bug fixes throughout the app in older seasons",
        "Bug fixes in data management to fix points counting for pre 1980 seasons",
        "Fixed bug in animation delay for dashboard navigation bar",
        "Fixed bug in season list showing glitched indicator when certain defaults are selected",
        "Fixed bug in negative penalties being shown for constructor due to sprint qualifying",
        "Fixed bugs with rendering half points throughout season in light of 2021 Belgium Grand Prix result",
        "Fixed bug with the calendar view where single digit days get squashed",
        "Fixed some padding issues for Widgets in Android 12",
        "Fixed some crashes that happen on non-english devices",
        "Usual assortment of bug fixes and preparations for new features"
      ]
    },
    {
      "versionCode": 131,
      "versionName": "7.x.x",
      "isMajor": false,
      "title": "",
      "notes": [
        "Rewrites process of caching and updating race data to be persistent and auto updating",
        "Adds schedule preview to upcoming races in home screen",
        "Adds more animations around content loading",
        "Adds pull to refresh everywhere",
        "Adds new notification banner",
        "Adds autoscrolling to the current race when you open the app",
        "Adds practice, qualifying and race times to the race views for supported races",
        "Fixes issues with timezones not displaying correct race times in details view",
        "Minor theming updates for Android 12 Material you",
        "Usual assortment of bug fixes and accessibility improvements"
      ]
    },
    {
      "versionCode": 154,
      "versionName": "8.0.154",
      "isMajor": false,
      "title": "",
      "notes": [
        "2022! More content and feature preparations for the 2022 season, including provisional calendar with driver and constructor lineup",
        "Adds race highlights from F1 youtube channel to recent races"
      ]
    },
    {
      "versionCode": 160,
      "versionName": "8.1.160",
      "isMajor": false,
      "title": "",
      "notes": [
        "Adds all track layouts for all circuits in the history of the F1 championship",
        "Fixes old qualifying data showing some drivers numbers as null",
        "Fixes drivers being clickable in qualifying view to go to their overview",
        "Fixes accessibility navigation on race view, now navigates in podium order",
        "Fixes shake to report functionality by migrating to Shaky",
        "Fixes RSS loading indicator appearing when no sources are selected"
      ]
    },
    {
      "versionCode": 180,
      "versionName": "8.2.183",
      "isMajor": false,
      "title": "",
      "notes": [
        "Adds driver placeholder for when drivers images are not available",
        "Adds dark mode quick toggle",
        "Fixes handles for constructor standings pre 1958",
        "Fixes ordering of driver and constructor lineup when no races have taken palce",
        "Updates some circuit icons to match layout at time of race"
      ]
    }
  ]
}
